InformationRegisters/СтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтатусыДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусОплатыСчета</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовВыплатыСамозанятым</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовРеализации</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыКоммерческогоПредложения</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовПоступления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОтгрузки</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыПоступленияПоСчету</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусСчетаФактуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСчетаФактуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОригиналаСчетаФактуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовПоступления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЧекаНПД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЧековНПД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСтатусЧекаНПД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовПоступления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыплатыСамозанятым</v8:Type>
						<v8:Type>cfg:DocumentRef.АктСверкиВзаиморасчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.КоммерческоеПредложение</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыДокументовПоступления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыДокументовПоступления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОригиналПолучен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОригиналНеПолучен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ДополнительныеМетоды/Ext/Module.bsl
#Область Атол

Процедура ФормаПриСоздании(Форма, Один = Ложь, Два = Ложь, Три = Ложь, Четыре = Ложь, Пять = Ложь, Шесть = Ложь) Экспорт
	
	Группа = Форма.Элементы.Добавить("ФормаГруппаАтолОнлайн_Чеки", Тип("ГруппаФормы"), Форма.КоманднаяПанель);
	Группа.Вид = ВидГруппыФормы.Подменю;
	Группа.Заголовок = "АТОЛ Онлайн";
	Группа.Подсказка = "Форма группа атол онлайн чеки";
	
	Если Один Тогда
		ОтправитьЧек				=	Форма.Команды.Добавить("АтолОнлайн_ОтправитьЧек");
		ОтправитьЧек.Действие		=	"АТОЛ_АтолОнлайн_ОтправитьЧекВместо";
		ОтправитьЧек.Заголовок		=	"Отправить чек";
		
		КнопкаКоманды				=	Форма.Элементы.Добавить("ФормаАтолОнлайн_ОтправитьЧек", Тип("КнопкаФормы"), Группа);
		КнопкаКоманды.ИмяКоманды	=	"АтолОнлайн_ОтправитьЧек";
		КнопкаКоманды.Вид			=	ВидКнопкиФормы.ОбычнаяКнопка;
	КонецЕсли;
	
	Если Два Тогда
		ПроверитьСтатус				=	Форма.Команды.Добавить("АтолОнлайн_ОтправитьЧекАванс");
		ПроверитьСтатус.Действие	=	"АТОЛ_АтолОнлайн_ПроверитьСтатусРегистрацииЧекаВместо";
		ПроверитьСтатус.Заголовок	=	"Отправить чек (аванс)";
		
		КнопкаКоманды				=	Форма.Элементы.Добавить("ФормаАтолОнлайн_ОтправитьЧекАванс", Тип("КнопкаФормы"), Группа);
		КнопкаКоманды.ИмяКоманды	=	"АтолОнлайн_ОтправитьЧекАванс";
		КнопкаКоманды.Вид			=	ВидКнопкиФормы.ОбычнаяКнопка;
	КонецЕсли;
	
	Если Три Тогда
		ОтправитьЧекАванс			=	Форма.Команды.Добавить("АтолОнлайн_ОтправитьЧекОплатаКредита");
		ОтправитьЧекАванс.Действие	=	"АТОЛ_АтолОнлайн_ОтправитьЧекАвансВместо";
		ОтправитьЧекАванс.Заголовок	=	"Отправить чек (оплата кредита)";
		
		КнопкаКоманды				=	Форма.Элементы.Добавить("ФормаАтолОнлайн_ОтправитьЧекОплатаКредита", Тип("КнопкаФормы"), Группа);
		КнопкаКоманды.ИмяКоманды	=	"АтолОнлайн_ОтправитьЧекОплатаКредита";
		КнопкаКоманды.Вид			=	ВидКнопкиФормы.ОбычнаяКнопка;
	КонецЕсли;
	
	Если Четыре Тогда
		ОтправитьЧекОплата			=	Форма.Команды.Добавить("АтолОнлайн_ПроверитьСтатусРегистрацииЧека");
		ОтправитьЧекОплата.Действие	=	"АТОЛ_АтолОнлайн_ОтправитьЧекОплатаКредитаВместо";
		ОтправитьЧекОплата.Заголовок=	"Проверить статус регистрации чека";
		
		КнопкаКоманды				=	Форма.Элементы.Добавить("ФормаАтолОнлайн_ПроверитьСтатусРегистрацииЧека", Тип("КнопкаФормы"), Группа);
		КнопкаКоманды.ИмяКоманды	=	"АтолОнлайн_ПроверитьСтатусРегистрацииЧека";
		КнопкаКоманды.Вид			=	ВидКнопкиФормы.ОбычнаяКнопка;
	КонецЕсли;
	
	Если Пять Тогда
		ОтправитьЧекОплата			=	Форма.Команды.Добавить("АтолОнлайн_ОтправитьЧекКредит");
		ОтправитьЧекОплата.Действие	=	"АТОЛ_АтолОнлайн_ОтправитьЧекКредитВместо";
		ОтправитьЧекОплата.Заголовок=	"Отправить чек (кредит)";
		
		КнопкаКоманды				=	Форма.Элементы.Добавить("ФормаАтолОнлайн_ОтправитьЧекКредит", Тип("КнопкаФормы"), Группа);
		КнопкаКоманды.ИмяКоманды	=	"АтолОнлайн_ОтправитьЧекКредит";
		КнопкаКоманды.Вид			=	ВидКнопкиФормы.ОбычнаяКнопка;
	КонецЕсли;
	
	Если Шесть Тогда
		ОтправитьЧекОплата			=	Форма.Команды.Добавить("АтолОнлайн_ОтправитьЧекПолнаяОплата");
		ОтправитьЧекОплата.Действие	=	"АТОЛ_АтолОнлайн_ОтправитьЧекПолнаяОплатаВместо";
		ОтправитьЧекОплата.Заголовок=	"Отправить чек (полная оплата)";
		
		КнопкаКоманды				=	Форма.Элементы.Добавить("ФормаАтолОнлайн_ОтправитьЧекПолнаяОплата", Тип("КнопкаФормы"), Группа);
		КнопкаКоманды.ИмяКоманды	=	"АтолОнлайн_ОтправитьЧекПолнаяОплата";
		КнопкаКоманды.Вид			=	ВидКнопкиФормы.ОбычнаяКнопка;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Процедура Бекар_КонтрольПервичнойДокументации() Экспорт
	
	Запрос = Новый Запрос("Выбрать Первые 1 Рег.Настройка Из РегистрСведений.ДополнительныеНастройки КАК Рег Где Рег.Настройка = &Настройка И Рег.Используется");
	Запрос.УстановитьПараметр("Настройка", "Вести контроль первичной документации");
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда Возврат; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.Текст = "ВЫБРАТЬ
	               |	Док.ДокументОснование КАК ЗаявкаНаЗатраты,
	               |	Док.Ссылка КАК Ссылка,
	               |	ВЫБОР
	               |		КОГДА Док.ДатаПредоставленияДокументаЗатрат = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА Док.Дата
	               |		ИНАЧЕ Док.ДатаПредоставленияДокументаЗатрат
	               |	КОНЕЦ КАК ДатаПредоставления,
	               |	ЕСТЬNULL(Поступление.Ссылка, ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)) КАК Поступление,
	               |	Поступление.Ссылка ЕСТЬ NULL КАК НетПоступления,
	               |	ЕСТЬNULL(Рег.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовПоступления.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовПоступления.ОригиналПолучен) КАК ОригиналПолучен
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	Документ.бит_РасходнаяПозиция КАК Док
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК Поступление
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК Рег
	               |			ПО (Рег.Документ = Поступление.Ссылка)
	               |		ПО Док.Ссылка = Поступление.бит_РасходнаяПозиция
	               |ГДЕ
	               |	Док.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Вт.ЗаявкаНаЗатраты КАК ЗаявкаНаЗатраты,
	               |	Вт.Ссылка КАК Ссылка,
	               |	Вт.ДатаПредоставления КАК ДатаПредоставления,
	               |	Вт.Поступление КАК Поступление,
	               |	Вт.ОригиналПолучен КАК ОригиналПолучен,
				   |	НЕ Вт.ОригиналПолучен
	               |		И НЕ Вт.НетПоступления
				   |		И ДОБАВИТЬКДАТЕ(Вт.ДатаПредоставления, ДЕНЬ, 3) < &ТекущаяДата КАК ОсталосьТриДня,
	               |	НЕ Вт.ОригиналПолучен
	               |		И НЕ Вт.НетПоступления
	               |		И Вт.ДатаПредоставления < &ТекущаяДата КАК Просрочено,
	               |	НЕ Вт.ОригиналПолучен
	               |		И НЕ Вт.НетПоступления
	               |		И ДОБАВИТЬКДАТЕ(Вт.ДатаПредоставления, МЕСЯЦ, 1) < &ТекущаяДата КАК ПросроченоНаМесяц
	               |ПОМЕСТИТЬ ХЗ
	               |ИЗ
	               |	ВТ КАК Вт
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ХЗ.ЗаявкаНаЗатраты КАК ЗаявкаНаЗатраты,
	               |	ХЗ.Ссылка КАК Ссылка,
	               |	ХЗ.ДатаПредоставления КАК ДатаПредоставления,
	               |	ХЗ.Поступление КАК Поступление,
	               |	ХЗ.ОригиналПолучен КАК ОригиналПолучен,
				   |	ХЗ.ОсталосьТриДня КАК ОсталосьТриДня,
	               |	ХЗ.Просрочено КАК Просрочено,
	               |	ХЗ.ПросроченоНаМесяц КАК ПросроченоНаМесяц
	               |ИЗ
	               |	ХЗ КАК ХЗ
	               |ГДЕ
	               |	(ХЗ.Просрочено
	               |			ИЛИ ХЗ.ПросроченоНаМесяц)";
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Табл = Новый ТаблицаЗначений;
	Табл.Колонки.Добавить("ТипУведомления");
	Табл.Колонки.Добавить("Пользователь");
	Табл.Колонки.Добавить("Заявка");
	Табл.Колонки.Добавить("Позиция");
	Табл.Колонки.Добавить("Поступление");
	Табл.Колонки.Добавить("Проект");
	Табл.Колонки.Добавить("Почта");
	
	Пока Рез.Следующий() Цикл
		
		Если Рез.ОсталосьТриДня Тогда
			
			Нов = Табл.Добавить();
			Нов.ТипУведомления = "ОсталосьТриДня";
			Нов.Пользователь = Рез.Ссылка.Ответственный;
			Нов.Заявка = Рез.ЗаявкаНаЗатраты;
			Нов.Позиция = Рез.Ссылка;
			Нов.Поступление = Рез.Поступление;
			
		КонецЕсли;
		
		Если Рез.Просрочено Тогда
			
			Нов = Табл.Добавить();
			Нов.ТипУведомления = "Просрочено";
			Нов.Пользователь = Рез.Ссылка.Ответственный;
			Нов.Заявка = Рез.ЗаявкаНаЗатраты;
			Нов.Позиция = Рез.Ссылка;
			Нов.Поступление = Рез.Поступление;
			
		КонецЕсли;
		
		Если Рез.ПросроченоНаМесяц Тогда
			
			Для Каждого Стр Из Рез.Ссылка.Распределение Цикл
				
				Отбор = Новый Структура;
				Отбор.Вставить("ЦФО", Стр.ЦФО);
				Отбор.Вставить("ТипОтветственного", Перечисления.Д_ТипыОтветственных.Ответственный);
				Поиск = Стр.Проект.Ответственные.НайтиСтроки(Отбор);
				Если Поиск.Количество() = 1 Тогда
					
					Нов = Табл.Добавить();
					Нов.ТипУведомления = "ПросроченоНаМесяц";
					Нов.Пользователь = Поиск[0].Ответственный;
					Нов.Заявка = Рез.ЗаявкаНаЗатраты;
					Нов.Позиция = Рез.Ссылка;
					Нов.Поступление = Рез.Поступление;
					
				Иначе
					
					Нов = Табл.Добавить();
					Нов.ТипУведомления = "НетОтветственного";
					Нов.Пользователь = Справочники.Пользователи.ПустаяСсылка();
					Нов.Заявка = Рез.ЗаявкаНаЗатраты;
					Нов.Позиция = Рез.Ссылка;
					Нов.Проект = Стр.Проект;
					Нов.Поступление = Рез.Поступление;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Стр Из Табл Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		Поиск = Стр.Пользователь.КонтактнаяИнформация.НайтиСтроки(Отбор);
		Если Поиск.Количество() = 0 Тогда
			Если Стр.ТипУведомления <> "НетОтветственного" Тогда
				Стр.ТипУведомления = "НетПочтыПользователя";
			КонецЕсли;
			Стр.Почта = "a.nerush@becar-group.com";
		Иначе
			Стр.Почта = Поиск[0].Представление;
		КонецЕсли;
		
	КонецЦикла;
	
	Табл.Сортировать("Почта, ТипУведомления");
	ТекПочта = ""; МЗ = Неопределено;
	Для Каждого Стр Из Табл Цикл
		
		Если ТекПочта <> Стр.Почта Тогда
			
			Если МЗ <> Неопределено Тогда
				МЗ.Записать(Истина);
			КонецЕсли;
			ТекПочта = Стр.Почта;
			МЗ = РегистрыСведений.бит_фн_Оповещения.СоздатьМенеджерЗаписи();
			МЗ.АдресПолучателя = ТекПочта;
			МЗ.Статус = Перечисления.бит_фн_СтатусыОтправкиОповещений.ГотовоКОтправке;
		    МЗ.НастройкаДоставки = Справочники.бит_фн_НастройкиДоставкиОповещений.НайтиПоКоду("00-000001");
			МЗ.ДатаРегистрации = ТекущаяДата();
			МЗ.СпособТранспорта = Перечисления.бит_фн_СпособыТранспортаОповещений.ЭлектроннаяПочта;
			МЗ.ТипТекстаСообщения = "ПростойТекст";
			Если ЗначениеЗаполнено(Стр.Пользователь) Тогда
				МЗ.Пользователь = Стр.Пользователь;
			Иначе
				МЗ.Пользователь = Справочники.Пользователи.НайтиПоНаименованию("Неруш Александр");
			КонецЕсли;
			
		КонецЕсли;
		
		Если МЗ.Сообщение_Текст <> "" Тогда
			МЗ.Сообщение_Текст = МЗ.Сообщение_Текст + "
			|";
		КонецЕсли;
		
		Если Стр.ТипУведомления = "ОсталосьТриДня" Тогда
			МЗ.Сообщение_Текст = МЗ.Сообщение_Текст + 
			"Осталось 3 дня на получение первичной документации по поступлению товаров № " + СокрЛп(Стр.Поступление.Номер) + " от " + Формат(Стр.Поступление.Дата, "ДЛФ=ДД");
		ИначеЕсли Стр.ТипУведомления = "Просрочено" Тогда
			МЗ.Сообщение_Текст = МЗ.Сообщение_Текст + 
			"По поступлению товаров №  " + СокрЛп(Стр.Поступление.Номер) + " от " + Формат(Стр.Поступление.Дата, "ДЛФ=ДД") + " не получена перчичная документация!";
		ИначеЕсли Стр.ТипУведомления = "ПросроченоНаМесяц" Тогда
			МЗ.Сообщение_Текст = МЗ.Сообщение_Текст + 
			"По поступлению товаров №  " + СокрЛп(Стр.Поступление.Номер) + " от " + Формат(Стр.Поступление.Дата, "ДЛФ=ДД") + " не получена перчичная документация! Задержка более месяца!";
		ИначеЕсли Стр.ТипУведомления = "НетОтветственного" Тогда
			МЗ.Сообщение_Текст = МЗ.Сообщение_Текст + 
			"По заявке на затраты № " + СокрЛп(Стр.Заявка.Номер) + " от " + Формат(Стр.Заявка.Дата, "ДЛФ=ДД") + " по проекту: " + Стр.Проект.Наименование + " нет ответственного!!!";
		ИначеЕсли Стр.ТипУведомления = "НетПочтыПользователя" Тогда
			МЗ.Сообщение_Текст = МЗ.Сообщение_Текст + 
			"У пользователя: " + Стр.Пользователь.Наименование + " не указан адрес электронной почты!";
		КонецЕсли;
		
	КонецЦикла;
	
	Если МЗ <> Неопределено Тогда МЗ.Записать(Истина); КонецЕсли;	
	
КонецПроцедуры

Процедура ДобавлениеОбщегоРеквизита(Форма) Экспорт
	
	ИмяФормыМассив = СтрРазделить(Форма.ИмяФормы, ".", Ложь);
	Если ИмяФормыМассив[0] = "Справочник" Тогда
	
		РеквизитыФормы = Форма.ПолучитьРеквизиты();
		Если РеквизитыФормы.Количество() > 1 Тогда
			
			// Преположим что сюда летят только формы справочников они или списка или элемента			
			ГлавныйРеквизит = РеквизитыФормы[0];
			ТипГлавногоРеквизита = ГлавныйРеквизит.ТипЗначения.Типы()[0];
			
			Если ТипГлавногоРеквизита <> Тип("ДинамическийСписок") И Форма[ГлавныйРеквизит.Имя].Свойство("НеИспользуется") Тогда
			
				НовыйЭлемент = Форма.Элементы.Добавить("НеИспользуется", Тип("ПолеФормы"));
				НовыйЭлемент.ПутьКДанным = ГлавныйРеквизит.Имя + ".НеИспользуется";
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура КонтрагентыДоговорыПриЗаписиДляСкладаПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ДополнительныеСвойства.Свойство("бит_мдм_РазрешеноИзменение") И Источник.ДополнительныеСвойства.бит_мдм_РазрешеноИзменение Тогда
	
		НЗ = РегистрыСведений.ОбменСоСкладом.СоздатьНаборЗаписей();
		НЗ.Отбор.Ссылка.Установить(Источник.Ссылка);
		НЗ.Прочитать();
		НЗ.Очистить();
		Нов = НЗ.Добавить();
		Нов.Ссылка = Источник.Ссылка;
		Нов.ДатаОбновления = ТекущаяДата();
		НЗ.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура Бекар_КонтрольПросроченойЗадолжности() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Рег.Подотчетник КАК Подотчетник,
	               |	Рег.ЦФО КАК ЦФО,
	               |	Рег.ДокументАванса.Дата КАК Период,
	               |	Рег.СуммаОстаток КАК СуммаОстаток
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	РегистрНакопления.Д_ЗадолжностьПодотчетныхЛиц.Остатки КАК Рег
	               |ГДЕ
	               |	Рег.СуммаОстаток > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Подотчетник КАК Подотчетник,
	               |	ВТ.ЦФО КАК ЦФО,
	               |	ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ВТ.Период, МЕСЯЦ), ДЕНЬ, Рег.Смещение) КАК КонецСоСмещением,
	               |	ВТ.СуммаОстаток КАК СуммаОстаток,
	               |	Рег.Лимит КАК Лимит
	               |ПОМЕСТИТЬ ВТ2
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Д_КонтрольАвнсов.СрезПоследних(, Контролировать = ИСТИНА) КАК Рег
	               |		ПО ВТ.Подотчетник = Рег.Подотчетник
	               |			И ВТ.ЦФО = Рег.ЦФО
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Вт2.Подотчетник КАК Подотчетник,
	               |	Вт2.ЦФО КАК ЦФО,
	               |	СУММА(Вт2.СуммаОстаток - Вт2.Лимит) КАК Долг
	               |ПОМЕСТИТЬ ВТ3
	               |ИЗ
	               |	ВТ2 КАК Вт2
	               |ГДЕ
	               //|	Вт2.КонецСоСмещением >= &ТекущаяДата
				   |	Вт2.КонецСоСмещением <= &ТекущаяДата
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Вт2.Подотчетник,
	               |	Вт2.ЦФО
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Вт3.Подотчетник КАК Подотчетник,
	               |	Вт3.ЦФО КАК ЦФО,
	               |	Вт3.Долг КАК Долг
	               |ИЗ
	               |	ВТ3 КАК Вт3
	               |ГДЕ
	               |	Вт3.Долг > 0
	               |ИТОГИ ПО
	               |	Подотчетник";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		
	Подотчетник = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Табл = Новый ТаблицаЗначений;
	Табл.Колонки.Добавить("Подотчетник");
	Табл.Колонки.Добавить("Заголовок");
	Табл.Колонки.Добавить("Email");
	Табл.Колонки.Добавить("ТекстСообщения");
	
	Пока Подотчетник.Следующий() Цикл
		
		Нов = Табл.Добавить();
		Нов.Подотчетник = Подотчетник.Подотчетник;
		Нов.ТекстСообщения = "<html><body><div>
		|Уважаемый(ая) " + Подотчетник.Подотчетник.Наименование + "
		|<br>
		|<br>Обращаем внимание, что у вас просроченая задолжность по выданным подотчет денежным средствам
		|<br>
		|<table border=""1"" cellpadding=""0"">
		|<tr>
		|<th>ЦФО</th>
		|<th>СУММА</th>
		|</tr>";
		
		Долг = Подотчетник.Выбрать();
		
		Пока Долг.Следующий() Цикл
			
			Нов.ТекстСообщения = Нов.ТекстСообщения + "
			|<tr>
			|<td>" + Долг.ЦФО.Наименование + "</td>
			|<td>" + Долг.Долг + "</td>
			|</tr>";
			
		КонецЦикла;
		
		Нов.ТекстСообщения = Нов.ТекстСообщения + "
		|</div></body></html>";
		
	КонецЦикла;
	
	// Заполнение Email
	Для Каждого Стр Из Табл Цикл
		
		Запрос = Новый Запрос("Выбрать Первые 1 Спр.Ссылка Из Справочник.Пользователи КАК Спр Где Спр.ФизическоеЛицо = &ФизЛицо");
		Запрос.УстановитьПараметр("ФизЛицо", Стр.Подотчетник);
		Рез = Запрос.Выполнить().Выбрать();
		
		Если Рез.Следующий() Тогда
			
			Отбор = Новый Структура;
			Отбор.Вставить("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			Поиск = Рез.Ссылка.КонтактнаяИнформация.НайтиСтроки(Отбор);
			
			Если Поиск.Количество() = 0 Тогда
				
				Стр.EMail = "v.vorfolomeev@becar-group.com";
				Стр.Заголовок = "У пользователя подотчетного лица не указана почта в 1с!!!";
				
			Иначе
				
				Стр.EMail = Поиск[0].Представление;
				Стр.Заголовок = "Обнаружена не погашеная задолжность!!!";
				
			КонецЕсли;
			
		Иначе
			
			Стр.EMail = "v.vorfolomeev@becar-group.com";
			Стр.Заголовок = "У подотчетного лица не найден пользователь в 1с!!!";
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Отправка
	Для Каждого Стр Из Табл Цикл
		
		МЗ = РегистрыСведений.бит_фн_Оповещения.СоздатьМенеджерЗаписи();
		МЗ.АдресПолучателя = Стр.EMail;
		МЗ.Статус = Перечисления.бит_фн_СтатусыОтправкиОповещений.ГотовоКОтправке;
		МЗ.НастройкаДоставки = Справочники.бит_фн_НастройкиДоставкиОповещений.НайтиПоКоду("000000001");
		МЗ.ДатаРегистрации = ТекущаяДата();
		МЗ.СпособТранспорта = Перечисления.бит_фн_СпособыТранспортаОповещений.ЭлектроннаяПочта;
		МЗ.Пользователь = Справочники.Пользователи.НайтиПоНаименованию("Неруш Александр");
		МЗ.Сообщение_Заголовок = Стр.Заголовок;
		МЗ.Сообщение_Текст = Стр.ТекстСообщения;
		МЗ.ТипТекстаСообщения = "HTML";
		МЗ.ИД = Новый УникальныйИдентификатор;
		МЗ.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры
